{
  "words": [
    { "english": "Admire" , "turkish": "saygı duymak" , "sentences": "She looked up to her grandmother and admired her wisdom and kindness." },
    { "english": "Confident" , "turkish": "kendinden emin" , "sentences": "Despite the challenges, he remained confident that he could achieve his goals." },
    { "english": "Accomplish" , "turkish": "başarmak" , "sentences": "The team worked together seamlessly to accomplish the challenging project on time."},
    { "english": "Diligent" , "turkish": "çalışkan" , "sentences": "The project required diligent planning and execution to meet the strict deadlines." },
    { "english": "Grateful" , "turkish": "minnetkar" , "sentences": "She felt so grateful for the opportunity to travel and experience new cultures." },
    { "english": "Inspired" , "turkish": "ilhamlı" , "sentences": "Her dedication to charity work is truly inspiring, motivating others to get involved."},
    { "english": "Curious" , "turkish": "meraklı" , "sentences": "As a child, her curious nature led her to explore every corner of the garden." },
    { "english": "Desire" , "turkish": "arzu" , "sentences": "The company's commitment to fulfilling customer desires has contributed to its success." },
    { "english": "Eager" , "turkish": "istekli" , "sentences": "The students were eager to start the new semester and dive into their studies." },
    { "english": "Ambitious" , "turkish": "hırslı" , "sentences": "The ambitious project required a dedicated team and careful planning."},
    { "english": "Patient" , "turkish": "hasta" , "sentences": "The patient cat waited quietly for its owner to return home."},
    { "english": "Debug" , "turkish": "hata ayıklama" , "sentences": "The team collaborated to debug the software before the deadline, addressing any issues."},
    { "english": "Interface" , "turkish": "arayüz" , "sentences": "The engineer is working on designing a new interface for the company's software."},
    { "english": "Resilient" , "turkish": "dayanıklı" , "sentences": "Despite facing numerous challenges and setbacks, the community remained resilient, coming together to rebuild and thrive once again."},
    { "english": "Crucial" , "turkish": "hayati" , "sentences": "Time management is crucial for balancing work and personal life effectively."},
    { "english": "Engaging" , "turkish": "ilgi çekici" , "sentences": "The conference had engaging speakers who captivated the audience with their insightful presentations."},
    { "english": "Stimulate" , "turkish": "uyarmak" , "sentences": "Reading thought-provoking books can stimulate your imagination and creativity."},
    { "english": "Despite" , "turkish": "rağmen" , "sentences": "Despite the rain, we decided to go for a hike in the mountains"},
    { "english": "Persistence" , "turkish": "azim" , "sentences": "Her dream of becoming a musician was realized through her persistence and constant practice."},
    { "english": "Sustainability" , "turkish": "sürdürülebilirlik" , "sentences": "Many companies are adopting sustainable practices to reduce their carbon footprint and contribute to a healthier planet."},
    { "english": "Harmony" , "turkish": "uyum" , "sentences": "The colors in the painting were chosen to create a sense of harmony and balance."},
    { "english": "Comprehension" , "turkish": "anlama" , "sentences": "Her comprehension of the novel's complex themes impressed her English teacher."},
    { "english": "Afterward" , "turkish": "sonradan" , "sentences": "She finished her work, and afterward, she went for a walk to relax."},
    { "english": "Engrossed" , "turkish": "kendini kaptırmış" , "sentences": "She was so engrossed in the book that she didn't hear the phone ringing."},
    { "english": "Embarked" , "turkish": "yola çıkmak" , "sentences": "They embarked on a journey to explore ancient ruins in Greece."},
    { "english": "Nestled" , "turkish": "yerleşmiş" , "sentences": "The cabin was nestled in a peaceful valley surrounded by tall trees."},
    { "english": "Breathtaking" , "turkish": "nefes kesici" , "sentences": "The view from the mountaintop was absolutely breathtaking."},
    { "english": "Spirit" , "turkish": "ruhsal durum" , "sentences": "Her positive spirit helped her overcome challenges and inspire others"},
    { "english": "Pursue" , "turkish": "kovalamak" , "sentences": "He decided to pursue a career in medicine to help others."},
    { "english": "Frustrated" , "turkish": "hayal kırıklığına uğramış" , "sentences": "After hours of trying to fix the computer, she felt frustrated."},
    { "english": "Serenity" , "turkish": "huzur" , "sentences": "The sound of the ocean waves brought a sense of serenity to the beach"},
  ]
}
