{
  "words": [
    { "english": "Admire" , "turkish": "saygı duymak" , "sentences": "She looked up to her grandmother and admired her wisdom and kindness." },
    { "english": "Confident" , "turkish": "kendinden emin" , "sentences": "Despite the challenges, he remained confident that he could achieve his goals." },
    { "english": "Accomplish" , "turkish": "başarmak" , "sentences": "The team worked together seamlessly to accomplish the challenging project on time."},
    { "english": "Diligent" , "turkish": "çalışkan" , "sentences": "The project required diligent planning and execution to meet the strict deadlines." },
    { "english": "Grateful" , "turkish": "minnetkar" , "sentences": "She felt so grateful for the opportunity to travel and experience new cultures." },
    { "english": "Inspired" , "turkish": "ilhamlı" , "sentences": "Her dedication to charity work is truly inspiring, motivating others to get involved."},
    { "english": "Curious" , "turkish": "meraklı" , "sentences": "As a child, her curious nature led her to explore every corner of the garden." },
    { "english": "Desire" , "turkish": "arzu" , "sentences": "The company's commitment to fulfilling customer desires has contributed to its success." },
    { "english": "Eager" , "turkish": "istekli" , "sentences": "The students were eager to start the new semester and dive into their studies." },
    { "english": "Ambitious" , "turkish": "hırslı" , "sentences": "The ambitious project required a dedicated team and careful planning."},
    { "english": "Patient" , "turkish": "hasta" , "sentences": "The patient cat waited quietly for its owner to return home."},
    { "english": "Debug" , "turkish": "hata ayıklama" , "sentences": "The team collaborated to debug the software before the deadline, addressing any issues."},
    { "english": "Interface" , "turkish": "arayüz" , "sentences": "The engineer is working on designing a new interface for the company's software."},
    { "english": "Resilient" , "turkish": "dayanıklı" , "sentences": "Despite facing numerous challenges and setbacks, the community remained resilient, coming together to rebuild and thrive once again."},
    { "english": "Crucial" , "turkish": "hayati" , "sentences": "Time management is crucial for balancing work and personal life effectively."},
    { "english": "Engaging" , "turkish": "ilgi çekici" , "sentences": "The conference had engaging speakers who captivated the audience with their insightful presentations."},
    { "english": "Stimulate" , "turkish": "uyarmak" , "sentences": "Reading thought-provoking books can stimulate your imagination and creativity."},
    { "english": "Despite" , "turkish": "rağmen" , "sentences": "Despite the rain, we decided to go for a hike in the mountains"},
    { "english": "Persistence" , "turkish": "azim" , "sentences": "Her dream of becoming a musician was realized through her persistence and constant practice."},
    { "english": "Sustainability" , "turkish": "sürdürülebilirlik" , "sentences": "Many companies are adopting sustainable practices to reduce their carbon footprint and contribute to a healthier planet."},
    { "english": "Harmony" , "turkish": "uyum" , "sentences": "The colors in the painting were chosen to create a sense of harmony and balance."},
    { "english": "Comprehension" , "turkish": "anlama" , "sentences": "Her comprehension of the novel's complex themes impressed her English teacher."},
    { "english": "Afterward" , "turkish": "sonradan" , "sentences": "She finished her work, and afterward, she went for a walk to relax."},
    { "english": "Engrossed" , "turkish": "kendini kaptırmış" , "sentences": "She was so engrossed in the book that she didn't hear the phone ringing."},
    { "english": "Embarked" , "turkish": "yola çıkmak" , "sentences": "They embarked on a journey to explore ancient ruins in Greece."},
    { "english": "Nestled" , "turkish": "yerleşmiş" , "sentences": "The cabin was nestled in a peaceful valley surrounded by tall trees."},
    { "english": "Breathtaking" , "turkish": "nefes kesici" , "sentences": "The view from the mountaintop was absolutely breathtaking."},
    { "english": "Spirit" , "turkish": "ruhsal durum" , "sentences": "Her positive spirit helped her overcome challenges and inspire others"},
    { "english": "Pursue" , "turkish": "kovalamak" , "sentences": "He decided to pursue a career in medicine to help others."},
    { "english": "Frustrated" , "turkish": "hayal kırıklığına uğramış" , "sentences": "After hours of trying to fix the computer, she felt frustrated."},
    { "english": "Serenity" , "turkish": "huzur" , "sentences": "The sound of the ocean waves brought a sense of serenity to the beach"},
    { "english": "Mankind" , "turkish": "insanlık" , "sentences": "Mankind has made significant advancements in technology over the past century."},
    { "english": "Obviously" , "turkish": "açıkcası" , "sentences": " She was late for the meeting, so obviously, she missed the presentation."},
    { "english": "Humble" , "turkish": "mütevazi" , "sentences": " Despite his success, he remained a humble and down-to-earth person."},
    { "english": "Inevitable" , "turkish": "kaçınılmaz" , "sentences": " Change is inevitable, and we must adapt to new circumstances."},
    { "english": "Profound" , "turkish": "etkileyici" , "sentences": "The author's novel explored profound themes of love and loss that resonated with readers."},
    { "english": "Lucrative" , "turkish": "kazançlı" , "sentences": "Investing in real estate can be quite lucrative if done wisely."},
    { "english": "Glacial" , "turkish": "buzul" , "sentences": "The glacial water of the mountain stream was so cold that it made my fingers numb."},
    { "english": "Existential" , "turkish": "varoluşsal" , "sentences": "Many philosophers delve into the realm of existential questions about the meaning of life and human existence."},
    { "english": "Detonation" , "turkish": "patlama" , "sentences": "The detonation of the explosives was so powerful that it could be heard from miles away."},
    { "english": "Mishap" , "turkish": "talihsizlik" , "sentences": "The mishap at the construction site resulted in a delay in the project's timeline."},
    { "english": "Besides" , "turkish": "ayrıca" , "sentences": "Besides studying for the exam, I also have to complete my essay tonight."},
    { "english": "Perhaps" , "turkish": "belki" , "sentences": "Perhaps we can meet for coffee tomorrow if you're available."},
    { "english": "Behave" , "turkish": "davranmak" , "sentences": "The children were asked to behave politely during the school assembly."},
    { "english": "Scam" , "turkish": "dolandırıcılık" , "sentences": "Be cautious when receiving emails from unknown sources; they might be trying to scam you with phishing schemes."},
    { "english": "Thrive" , "turkish": "gelişmek" , "sentences": "Despite facing many challenges, the small business managed to thrive and expand its operations."},
    { "english": "Opportunity" , "turkish": "fırsat" , "sentences": "Don't miss this golden opportunity to showcase your talent and skills."},
    { "english": "Suggestion" , "turkish": "öneri" , "sentences": "We welcome your suggestions for improving our products and services."},
    { "english": "Survey" , "turkish": "anket" , "sentences": "We conducted a survey to gather feedback from our customers about their satisfaction with our services."},
    { "english": "Jubilant" , "turkish": "sevinçli" , "sentences": "The team was jubilant after winning the championship, celebrating their victory with cheers and laughter."},
    { "english": "Serendipity" , "turkish": "tesadüf" , "sentences": "Their encounter in the bookstore was pure serendipity, leading to a lifelong friendship."},
    { "english": "Deterrent" , "turkish": "caydırıcı" , "sentences": "The security cameras act as a deterrent to potential burglars."},
    { "english": "Precaution" , "turkish": "önlem" , "sentences": "As a precaution against the storm, they boarded up their windows and stocked up on emergency supplies."},
    { "english": "Withdrawal" , "turkish": "geri çekilme" , "sentences": "After his withdrawal from the competition, he decided to focus on his studies instead."},
    { "english": "Hospitable" , "turkish": "misafirperver" , "sentences": "The people in that small town are known for their hospitable nature, always welcoming visitors with a warm smile."},
    { "english": "Instantaneous" , "turkish": "anında" , "sentences": "With the click of a button, the camera captured an instantaneous snapshot of the stunning sunset"},
    { "english": "Precisely" , "turkish": "kesinlikle" , "sentences": "She knew precisely what needed to be done to solve the complex problem."},
    { "english": "Exponentially" , "turkish": "üssel bir şekilde katlanarak" , "sentences": "With the advancement of technology, computing power has grown exponentially over the past decade."},
    { "english": "Starving" , "turkish": "açlık" , "sentences": "After a long hike, we were all starving, so we decided to have a big meal at the local restaurant."},
    { "english": "Deteriorate" , "turkish": "kötüleşmek" , "sentences": "If you don't take care of your car, its condition will deteriorate over time."},
    { "english": "Signify" , "turkish": "ifade etmek" , "sentences": "His actions signify his commitment to the cause."},
    { "english": "Commitment" , "turkish": "bağlılık" , "sentences": "Their commitment to environmental conservation is evident through their sustainable practices."},
    { "english": "Neglected" , "turkish": "ihmal edilmiş" , "sentences": "The old house had been neglected for years, and it was in need of extensive repairs."},
    { "english": "Betrayed" , "turkish": "ihanet etmiş" , "sentences": "He felt deeply hurt when he realized that his friend had betrayed his trust."},
    { "english": "Execute" , "turkish": "gerçekleştirmek" , "sentences": "The team will execute the project according to the plan they've developed."},
    { "english": "Freckles" , "turkish": "çil" , "sentences": "Her face was covered in freckles from spending so much time in the sun."},
    { "english": "Mellifluous" , "turkish": "sesi hoş" , "sentences": "Her mellifluous voice captivated the audience and brought tears to their eyes."},
    { "english": "Eloquent" , "turkish": "etkileyici konuşan" , "sentences": "Her eloquent speech at the conference left a lasting impression on the audience."},
    { "english": "Notice" , "turkish": "fark etme" , "sentences": "Did you notice the beautiful painting on the wall?"},
    { "english": "Invitation" , "turkish": "davetiye" , "sentences": "I received an invitation to my friend's wedding, and I'm excited to attend."},
    { "english": "Timidly" , "turkish": "çekingen bir şekilde" , "sentences": "She approached the podium timidly, unsure of how the audience would react to her speech."},
    { "english": "Noisy" , "turkish": "gürültülü" , "sentences": "The party next door was so noisy that I couldn't concentrate on my work."},
    { "english": "Attentively" , "turkish": "dikkatlice" , "sentences": "The teacher listened attentively to each student's question and provided helpful answers."},
    { "english": "Lullaby" , "turkish": "ninni" , "sentences": "The mother sang a sweet lullaby to her baby to help them fall asleep."},
    { "english": "Seriously" , "turkish": "ciddi bir şekilde" , "sentences": "He took the matter seriously and began to research it thoroughly."},
    { "english": "Thoroughly" , "turkish": "derinlemesine/bütünüyle" , "sentences": "She cleaned the entire house thoroughly before the guests arrived."},
    { "english": "Held(Hold)" , "turkish": "tutulan/tuttu" , "sentences": "She held the baby gently in her arms, cradling it to sleep."},
    { "english": "Grunt" , "turkish": "homurdanmak" , "sentences": "The tired hiker let out a grunt as he lifted his heavy backpack."},
    { "english": "Disappear" , "turkish": "kaybolmak" , "sentences": "The ship disappeared on the horizon as it sailed further out to sea."},
    { "english": "Cushion" , "turkish": "yastık" , "sentences": "She placed a soft cushion on the chair for extra comfort."},
    { "english": "Remark" , "turkish": "yorum/düşünce" , "sentences": "His remark about the movie was insightful and added depth to our discussion."},
    { "english": "Carefully" , "turkish": "dikkatlice" , "sentences": "She handled the fragile glassware carefully to avoid any breakage."},
    { "english": "Poured" , "turkish": "dökmek" , "sentences": "He poured a glass of water for himself and placed it on the table."},
    { "english": "Riddle" , "turkish": "bilmece" , "sentences": "Can you solve this riddle?"},
    { "english": "Reducing" , "turkish": "azaltma" , "sentences": "Reducing sugar intake can lead to better overall health."},
    { "english": "Crane" , "turkish": "vinç" , "sentences": "The construction site used a large crane to lift heavy materials."},
    { "english": "Steadily" , "turkish": "düzenli bir şekilde" , "sentences": "Her savings grew steadily over the years as she invested wisely."},
    { "english": "Shelter" , "turkish": "barınak" , "sentences": "During the storm, we sought shelter in a nearby building to stay safe."},
    { "english": "Sought" , "turkish": "aranmak(arama işlemi)" , "sentences": "The police sought the missing person for days before finding them safe."},
    { "english": "Entrance" , "turkish": "giriş yeri" , "sentences": "The entrance to the museum is on the left side of the building."},
    { "english": "Arrive" , "turkish": "varış" , "sentences": "The train will arrive at the station in 10 minutes."},
    { "english": "Towel" , "turkish": "havlu" , "sentences": "After swimming, I wrapped myself in a towel to dry off."},
    { "english": "Lay down" , "turkish": "uzanmak" , "sentences": "I like to lay down on the couch and relax after a long day at work."},
    { "english": "Occasionally" , "turkish": "zaman zaman" , "sentences": "I occasionally treat myself to a piece of chocolate as a little indulgence."},
    { "english": "Sparkling" , "turkish": "parıldayan" , "sentences": "She sipped on a sparkling glass of champagne during the celebration."},
    { "english": "As the day went on" , "turkish": "gün ilerledikçe" , "sentences": "As the day went on, the weather became increasingly cloudy and cooler."},
    { "english": "Sun began to set" , "turkish": "güneş batmaya başladı" , "sentences": ""},
    { "english": "Permanently" , "turkish": "kalıcı olarak" , "sentences": "He decided to move to a different city permanently to start a new life."},
    { "english": "Represents" , "turkish": "temsil eder" , "sentences": "The national flag of the country represents freedom and unity."},
    { "english": "Necklace" , "turkish": "kolye" , "sentences": "She wore a beautiful necklace adorned with sparkling diamonds to the gala event."},
    { "english": "" , "turkish": "" , "sentences": ""}
    
  ]
}
